src/cf/InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияПоследнейМеткиВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПодписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодписиКриптографии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторРучнойПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАтрибутыПровереныВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаМатематическойПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриАвтоматическомПродлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМатематическиВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропуститьПриПродлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьУникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОбъект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьУстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СведенияОбУчастникахДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбУчастникахДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокРассчитанный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭПЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭПЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителяЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителяЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Резолюции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Резолюции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторРезолюции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесРезолюцию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезолюции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Comment>Идентификатор участника действия</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Рассмотрение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстРезолюции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСРезолюциями/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ДЛЯ РАБОТЫ С РЕЗОЛЮЦИЯМИ
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает структуру ключевых реквизитов резолюции.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруКлючевыхРеквизитовРезолюции() Экспорт
	
	МассивИмен = Справочники.Резолюции.ПолучитьИменаКлючевыхРеквизитов();
	
	СтруктураРезолюции = Новый Структура;
	
	Для Каждого Имя Из МассивИмен Цикл
		СтруктураРезолюции.Вставить(Имя);
	КонецЦикла;
		
	Возврат СтруктураРезолюции;
	
КонецФункции

// Возвращает резолюции документа.
//
// Параметры:
//  Документ - ссылка на внутренний или входящий документ.
//  ТолькоАктивные - Булево - возвращать только не помеченные на удаление резолюции
//                   (по умолчанию Истина).
//  ПолучитьДанныеЭП - Булево - возвращать информацию об электронной подписи резолюции
//                     (по умолчанию Ложь).
//  Источник - ЗадачаСсылка.ЗадачаИсполнителя, БизнесПроцессСсылка.Рассмотрение - задача или процесс
//             создавшие резолюцию (по умолчанию Неопределено).
//  ИдентификаторУчастника - УникальныйИдентификатор - УникальныйИдентификатор участника рассмотрения.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьРезолюции(Документ, 
	ТолькоАктивные = Истина, 
	ПолучитьДанныеЭП = Ложь, 
	Источник = Неопределено, 
	ИдентификаторУчастника = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если ПолучитьДанныеЭП Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Резолюции.Ссылка КАК Ссылка,
			|	Резолюции.ПометкаУдаления КАК ПометкаУдаления,
			|	Резолюции.АвторРезолюции КАК АвторРезолюции,
			|	Резолюции.ВнесРезолюцию КАК ВнесРезолюцию,
			|	Резолюции.ДатаРезолюции КАК ДатаРезолюции,
			|	Резолюции.Документ КАК Документ,
			|	Резолюции.Источник КАК Источник,
			|	Резолюции.Подписана КАК Подписана,
			|	Резолюции.ТекстРезолюции КАК ТекстРезолюции,
			|	ЭП.ДатаПодписи КАК ДатаПодписи,
			|	ЭП.УстановившийПодпись КАК УстановившийПодпись,
			|	ЭП.ДатаПроверкиПодписи КАК ДатаПроверкиПодписи,
			|	ЭП.ПодписьВерна КАК ПодписьВерна,
			|	ЭП.ТекстОшибкиПроверкиПодписи КАК ТекстОшибкиПроверкиПодписи,
			|	ЭП.ТекстОшибкиПроверкиСертификата КАК ТекстОшибкиПроверкиСертификата,
			|	Резолюции.ИдентификаторУчастника КАК ИдентификаторУчастника,
			|	Резолюции.ФактическийАвтор КАК ФактическийАвтор,
			|	ВЫБОР
			|		КОГДА СведенияОбУчастникахДействий.ПредставлениеФактическогоИсполнителя <> """"
			|			ТОГДА СведенияОбУчастникахДействий.ПредставлениеФактическогоИсполнителя
			|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СведенияОбУчастникахДействий.ФактическийИсполнитель)
			|	КОНЕЦ КАК ПредставлениеФактическогоИсполнителя
			|ИЗ
			|	Справочник.Резолюции КАК Резолюции
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭП
			|		ПО (ЭП.ПодписанныйОбъект = Резолюции.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбУчастникахДействий КАК СведенияОбУчастникахДействий
			|		ПО Резолюции.ИдентификаторУчастника = СведенияОбУчастникахДействий.ИдентификаторУчастника
			|ГДЕ
			|	Резолюции.Документ = &Документ";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Резолюции.Ссылка КАК Ссылка,
			|	Резолюции.ПометкаУдаления КАК ПометкаУдаления,
			|	Резолюции.АвторРезолюции КАК АвторРезолюции,
			|	Резолюции.ВнесРезолюцию КАК ВнесРезолюцию,
			|	Резолюции.ДатаРезолюции КАК ДатаРезолюции,
			|	Резолюции.Документ КАК Документ,
			|	Резолюции.Источник КАК Источник,
			|	Резолюции.Подписана КАК Подписана,
			|	Резолюции.ТекстРезолюции КАК ТекстРезолюции,
			|	Резолюции.ИдентификаторУчастника КАК ИдентификаторУчастника,
			|	Резолюции.ФактическийАвтор КАК ФактическийАвтор,
			|	ВЫБОР
			|		КОГДА СведенияОбУчастникахДействий.ПредставлениеФактическогоИсполнителя <> """"
			|			ТОГДА СведенияОбУчастникахДействий.ПредставлениеФактическогоИсполнителя
			|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СведенияОбУчастникахДействий.ФактическийИсполнитель)
			|	КОНЕЦ КАК ПредставлениеФактическогоИсполнителя
			|ИЗ
			|	Справочник.Резолюции КАК Резолюции
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбУчастникахДействий КАК СведенияОбУчастникахДействий
			|		ПО Резолюции.ИдентификаторУчастника = СведенияОбУчастникахДействий.ИдентификаторУчастника
			|ГДЕ
			|	Резолюции.Документ = &Документ";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Если ТолькоАктивные Тогда
		Запрос.Текст = Запрос.Текст + " И Резолюции.ПометкаУдаления = Ложь
		|И (Резолюции.Источник ССЫЛКА Справочник.ДействияИсполнения
		|		И НЕ Резолюции.Источник.ПомещеноВИсторию
		|	ИЛИ НЕ Резолюции.Источник ССЫЛКА Справочник.ДействияИсполнения)";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник) Тогда
		Запрос.Текст = Запрос.Текст + " И Резолюции.Источник = &Источник";
		Запрос.УстановитьПараметр("Источник", Источник);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИдентификаторУчастника) Тогда
		Запрос.Текст = Запрос.Текст + " И Резолюции.ИдентификаторУчастника = &ИдентификаторУчастника";
		Запрос.УстановитьПараметр("ИдентификаторУчастника", ИдентификаторУчастника);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Резолюции.ДатаРезолюции УБЫВ";
	
	Запрос.Текст = МультиязычностьДокументооборот.ТекстЗапросаСведенийОбУчастникахСУчетомЯзыка(Запрос.Текст);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает резолюции документа на указанную дату.
//
// Параметры:
//  Документ - ссылка на внутренний или входящий документ.
//  ДатаРезолюции - Дата - дата, на которую необходимо найти резолюцию.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьРезолюциюПоДате(Документ, ДатаРезолюции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Резолюции.Ссылка
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции
		|ГДЕ
		|	Резолюции.Документ = &Документ
		|	И Резолюции.ДатаРезолюции = &ДатаРезолюции
		|	И Резолюции.ПометкаУдаления = Ложь";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДатаРезолюции", ДатаРезолюции);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Проверяет возможность подписания резолюции для текущего пользователя.
//
// Параметры:
//  Резолюция - ссылка или объект справочника Резолюции.
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьДоступНаПодписание(Резолюция) Экспорт
	
	Если ТипЗнч(Резолюция) = Тип("СправочникСсылка.Резолюции")
		Или ТипЗнч(Резолюция) = Тип("СправочникОбъект.Резолюции") Тогда
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		// Подписать резолюцию может только автор либо внесший резолюцию.
		Возврат
			Резолюция.ВнесРезолюцию = ТекущийПользователь
			Или Резолюция.АвторРезолюции = ТекущийПользователь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Помечает/снимает пометку на удаление резолюций по документу.
//
// Параметры:
//	Документ - СправочникСсылка.ДокументыПредприятия - Документ, резолюции которого необходимо пометить на удаление.
//	Пометка - Булево - Значение, которое нужно установить.
//	ИдентификаторУчастника - УникальныйИдентификатор - Идентификатор участника.
//
Процедура УстановитьПометкуУдаленияРезолюцийПоДокументу(Документ, Пометка, ИдентификаторУчастника = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Резолюции = ПолучитьРезолюции(Документ, Ложь, , , ИдентификаторУчастника);
	Для Каждого Резолюция Из Резолюции Цикл
		УстановитьПометкуНаУдаление(Резолюция, Пометка);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает / снимает пометку на удаление на резолюцию.
//
// Возвращаемое значение:
//  Истина, если установка пометки прошла успешно.
//
Функция УстановитьПометкуНаУдаление(Резолюция, ЗначениеПометкиУдаления) Экспорт

	Попытка
		ОбъектРезолюции = Резолюция.Ссылка.ПолучитьОбъект();
		ОбъектРезолюции.Заблокировать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
		
	ОбъектРезолюции.УстановитьПометкуУдаления(ЗначениеПометкиУдаления);
	ОбъектРезолюции.Разблокировать();
	
	Возврат Истина;
	
КонецФункции

// Определяет, является ли пользователем автором либо внесшим резолюцию.
//
// Параметры:
//  Резолюция - ссылка на справочник Резолюции
//  Пользователь - ссылка на справочник Пользователи - если не задан, то проверяется текущий
//                 пользователь.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоАвторРезолюции(Резолюция, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Возврат Пользователи.ЭтоПолноправныйПользователь()
		Или Пользователь = Резолюция.АвторРезолюции
		Или Пользователь = Резолюция.ВнесРезолюцию;
		
КонецФункции

#КонецОбласти
